rafaelwanner/ES_with_Drones/LAB5/STM32 FW Project/Official release - 170120/Src/main.c
/* USER CODE END 0 */

int main(void)
{

	/* USER CODE BEGIN 1 */
	int16_t /*pid_interval,*/ i;

	/* filtering and motion control variable initialization */
	//int mytimcnt = 0;
	acc_fil.AXIS_X = 0;
	acc_fil.AXIS_Y = 0;
	acc_fil.AXIS_Z = 0;
	mag_fil.AXIS_X = 0;
	mag_fil.AXIS_Y = 0;
	mag_fil.AXIS_Z = 0;
	gyro_fil.AXIS_X = 0;
	gyro_fil.AXIS_Y = 0;
	gyro_fil.AXIS_Z = 0;
	euler_rc_fil.thx = 0;
	euler_rc_fil.thy = 0;
	euler_rc_fil.thz = 0;
	acc_off_calc.AXIS_X = 0;
	acc_off_calc.AXIS_Y = 0;
	acc_off_calc.AXIS_Z = 0;
	gyro_off_calc.AXIS_X = 0;
	gyro_off_calc.AXIS_Y = 0;
	gyro_off_calc.AXIS_Z = 0;
	acc_offset.AXIS_X = 0;
	acc_offset.AXIS_Y = 0;
	acc_offset.AXIS_Z = 1000;
	gyro_offset.AXIS_X = 0;
	gyro_offset.AXIS_Y = 0;
	gyro_offset.AXIS_Z = 0;
	euler_rc.thz = euler_ahrs.thz;
	euler_ahrs_offset.thx = 0;
	euler_ahrs_offset.thy = 0;

	for(i=0;i<4;i++)
	{
		acc_y_pre[i].AXIS_X = 0;
		acc_y_pre[i].AXIS_Y = 0;
		acc_y_pre[i].AXIS_Z = 0;
		acc_x_pre[i].AXIS_X = 0;
		acc_x_pre[i].AXIS_Y = 0;
		acc_x_pre[i].AXIS_Z = 0;
		gyro_y_pre[i].AXIS_X = 0;
		gyro_y_pre[i].AXIS_Y = 0;
		gyro_y_pre[i].AXIS_Z = 0;
		gyro_x_pre[i].AXIS_X = 0;
		gyro_x_pre[i].AXIS_Y = 0;
		gyro_x_pre[i].AXIS_Z = 0;
		euler_rc_y_pre[i].thx = 0;
		euler_rc_y_pre[i].thy = 0;
		euler_rc_y_pre[i].thz = 0;
		euler_rc_x_pre[i].thx = 0;
		euler_rc_x_pre[i].thy = 0;
		euler_rc_x_pre[i].thz = 0;
	}
	/* USER CODE END 1 */

	/* MCU Configuration----------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* Configure the system clock */
	SystemClock_Config();

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_ADC1_Init();
	MX_TIM2_Init();
	MX_TIM4_Init();
	MX_TIM9_Init();
	MX_USART1_UART_Init();

	/* USER CODE BEGIN 2 */

	PRINTF("STEVAL-FCU001V1 PBL - Drones \n\r\n\r");

	//  Initialize Onboard LED
	BSP_LED_Init(LED1);
	BSP_LED_Init(LED2);
	BSP_LED_Off(LED1);
	BSP_LED_Off(LED2);

	/* Configure and disable all the Chip Select pins for sensors on SPI*/
	Sensor_IO_SPI_CS_Init_All();

	/* Initialize and Enable the available sensors on SPI*/
	initializeAllSensors();
	enableAllSensors();
	InitSensFilter();

	/* Initialize Remote control*/
	init_remote_control();

	/* Initialize TIM4 for Motors PWM Output*/
	HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_1);
	HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_2);
	HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_3);
	HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_4);

	/* Initialize General purpose TIM9 50Hz*/
	HAL_TIM_Base_Start_IT(&htim9);

	set_motor_pwm_zero(&motor_pwm);

	/* BLE communication */
	PRINTF("BLE communication initialization...\n\n");
	BlueNRG_Init();
	/* Initialize the BlueNRG Custom services */
	Init_BlueNRG_Custom_Services();

	/* BLE communication */
	PRINTF("LAB5 Init...\n\r\n\r");

	/* Read initial value of Pressure and Temperature for Altitude estimation */
	/* Read the Pressure level when arming (0m reference) for altitude calculation */
	BSP_PRESSURE_Get_Press(LPS22HB_P_0_handle, &press_zero_level);
	/* Read the Temperature when arming (0m reference) for altitude calculation */
	BSP_TEMPERATURE_Get_Temp(LPS22HB_T_0_handle, &temperature);

	/* USER CODE END 2 */
	int safety_flag = 1;

	/* Infinite loop */
	/* USER CODE BEGIN WHILE */
	while (1)
	{

		/* sample rate is 800 Hz */
		/*
		PRINTF("************************************\n\r\n\r");
		PRINTF("ACC[x,y,z] %d mg %d mg %d mg \n\r", acc.AXIS_X,acc.AXIS_Y,acc.AXIS_Z);
		PRINTF("GYR[x,y,z] %d mdps %d mdps %d mdps \n\r", gyro.AXIS_X,gyro.AXIS_Y,gyro.AXIS_Z);
		PRINTF("MAG[x,y,z] %d mg %d mg %d mg \n\r", mag.AXIS_X,mag.AXIS_Y,mag.AXIS_Z);
		PRINTF("Pre: %f hPa \n\r", press);
		PRINTF("************************************\n\r\n\r");
		*/

		if(HCI_ProcessEvent) {
			HCI_ProcessEvent=0;
			HCI_Process();
		}

		if(set_connectable){
			/* Now update the BLE advertize data and make the Board connectable */
			setConnectable();
			set_connectable = FALSE;
		}


		if (tim9_event_flag == 1)
		{     // Timer9 event: frequency 800Hz
			tim9_event_flag = 0;

			count1++;

			acc_ahrs.AXIS_X = 0;
			acc_ahrs.AXIS_Y = 0;
			acc_ahrs.AXIS_Z = 0;
			gyro_ahrs.AXIS_X = 0;
			gyro_ahrs.AXIS_Y = 0;
			gyro_ahrs.AXIS_Z = 0;

			for(i=0;i<FIFO_Order;i++)
			{
				acc_ahrs.AXIS_X += acc_ahrs_FIFO[i].AXIS_X;
				acc_ahrs.AXIS_Y += acc_ahrs_FIFO[i].AXIS_Y;
				acc_ahrs.AXIS_Z += acc_ahrs_FIFO[i].AXIS_Z;
				gyro_ahrs.AXIS_X += gyro_ahrs_FIFO[i].AXIS_X;
				gyro_ahrs.AXIS_Y += gyro_ahrs_FIFO[i].AXIS_Y;
				gyro_ahrs.AXIS_Z += gyro_ahrs_FIFO[i].AXIS_Z;
			}

			acc_ahrs.AXIS_X *=FIFO_Order_Recip;
			acc_ahrs.AXIS_Y *=FIFO_Order_Recip;
			acc_ahrs.AXIS_Z *=FIFO_Order_Recip;
			gyro_ahrs.AXIS_X *=FIFO_Order_Recip;
			gyro_ahrs.AXIS_Y *=FIFO_Order_Recip;
			gyro_ahrs.AXIS_Z *=FIFO_Order_Recip;


			acc_fil_int.AXIS_X = (int32_t) acc_ahrs.AXIS_X;
			acc_fil_int.AXIS_Y = (int32_t) acc_ahrs.AXIS_Y;
			acc_fil_int.AXIS_Z = (int32_t) acc_ahrs.AXIS_Z;
			gyro_fil_int.AXIS_X = (int32_t) gyro_ahrs.AXIS_X;
			gyro_fil_int.AXIS_Y = (int32_t) gyro_ahrs.AXIS_Y;
			gyro_fil_int.AXIS_Z = (int32_t) gyro_ahrs.AXIS_Z;


			//PRINTF("%f %f %f %f\n", acc_ahrs.AXIS_X, acc_ahrs.AXIS_Y, gyro_ahrs.AXIS_X, gyro_ahrs.AXIS_Y);

			// AHRS update, quaternion & true gyro data are stored in ahrs
			ahrs_fusion_ag(&acc_ahrs, &gyro_ahrs, &ahrs);

			// Calculate euler angle drone
			QuaternionToEuler(&ahrs.q, &euler_ahrs);



			//          gRUD = (joydata[3]-128)*(-13);
			//          gTHR = joydata[4]*13;
			//          gAIL = (joydata[5]-128)*(-13);
			//          gELE = (joydata[6]-128)*13;

			gRUD = (joydata[2]-128)*(-13);
			gTHR = joydata[3]*13;
			gAIL = (joydata[4]-128)*(-13);
			gELE = (joydata[5]-128)*13;

			PRINTF("gRUD: %d, gTHR: %d, gAIL: %d, gELE: %d", gRUD, gTHR, gAIL, gELE);
			PRINTF("thx: %f, thy: %f, thz: %f", euler_ahrs.thx, euler_ahrs.thy, euler_ahrs.thz);
			PRINTF("************************************\n\r\n\r");

			/* joydata[6]: seek bar data*/
			/* joydata[7]: additional button data
                        first bit: Takeoff (0 = Land,  1 = Takeoff)
                        second bit: Calibration When it changes status is active
                        third bit: Arming (0 = Disarmed,  1 = Armed) */

			gJoystick_status = joydata[7];
			if (((gJoystick_status&0x04)==0x04) & safety_flag){
				rc_enable_motor = 1;
				fly_ready = 1;
				BSP_LED_On(LED2);
			}
			else {
				rc_enable_motor = 0;
				fly_ready = 0;
			}

			/* INSERT YOUR CODE HERE!!!! LAB5 */
			// set motor output zero
			//set_motor_pwm_zero(&motor_pwm);
			//set_motor_pwm(&motor_pwm);


