rafaelwanner/ES_with_Drones/LAB5/STM32 FW Project/Official release - 170120/Src/main.c
		if(gTHR<MIN_THR)
		{
			euler_rc.thz = 0;
			euler_ahrs.thz = 0;
		}

	}
}



/**
 * @brief  Initialize all sensors
 * @param  None
 * @retval None
 */
static void initializeAllSensors( void )
{
	if (BSP_ACCELERO_Init( LSM6DSL_X_0, &LSM6DSL_X_0_handle ) != COMPONENT_OK)
	{
		while(1);
	}

	if (BSP_GYRO_Init( LSM6DSL_G_0, &LSM6DSL_G_0_handle ) != COMPONENT_OK)
	{
		while(1);
	}

	if (BSP_MAGNETO_Init( LIS2MDL_M_0, &LIS2MDL_M_0_handle ) != COMPONENT_OK)
	{
		while(1);
	}


	if (BSP_PRESSURE_Init( LPS22HB_P_0, &LPS22HB_P_0_handle ) != COMPONENT_OK)
	{
		while(1);
	}

	if (BSP_TEMPERATURE_Init( LPS22HB_T_0, &LPS22HB_T_0_handle ) != COMPONENT_OK)
	{
		while(1);
	}


}

/**
 * @brief  Enable all sensors
 * @param  None
 * @retval None
 */
void enableAllSensors( void )
{
	BSP_ACCELERO_Sensor_Enable( LSM6DSL_X_0_handle );
	PRINTF("LSM6DSL MEMS Accelerometer initialized and enabled\n\r");
	BSP_GYRO_Sensor_Enable( LSM6DSL_G_0_handle );
	PRINTF("LSM6DSL MEMS Gyroscope initialized and enabled\n\r");
	BSP_MAGNETO_Sensor_Enable( LIS2MDL_M_0_handle );
	PRINTF("LIS2MDL Magnetometer initialized and enabled\n\r");
	BSP_PRESSURE_Sensor_Enable( LPS22HB_P_0_handle );
	PRINTF("LPS22HB Pressure sensor initialized and enabled\n\r");
	BSP_TEMPERATURE_Sensor_Enable( LPS22HB_T_0_handle );
	PRINTF("LPS22HB Temperature sensor initialized and enabled\n\r");
}



void BlueNRG_Init(void)
{

	int ret = 1;
	uint8_t  hwVersion=0;
	uint16_t fwVersion=0;

	PRINTF("****** START BLE TESTS ******\r\n");
	BNRG_SPI_Init();

	/* Added on Jan 15, 2020 */
	bdaddr[0] = (STM32_UUID[1]>>24)&0xFF;
	bdaddr[1] = (STM32_UUID[0]    )&0xFF;
	bdaddr[2] = (STM32_UUID[2] >>8)&0xFF;
	bdaddr[3] = (STM32_UUID[0]>>16)&0xFF;
	bdaddr[4] = (hwVersion > 0x30) ?
			((((0x34-48)*10) + (0x30-48)+100)&0xFF) :
			((((0x34-48)*10) + (0x30-48)    )&0xFF) ;
	bdaddr[5] = 0xF9; /* for a Legal BLE Random MAC */

	/* Initialize the BlueNRG HCI */
	HCI_Init();

	/* Reset BlueNRG hardware */
	BlueNRG_RST();

	/* get the BlueNRG HW and FW versions */
	PRINTF("\r\nReading BlueNRG version ...\r\n");
	if (getBlueNRGVersion(&hwVersion, &fwVersion)== BLE_STATUS_SUCCESS)
	{

		/*
		 * Reset BlueNRG again otherwise it will fail.
		 */
		BlueNRG_RST();

		PRINTF("GATT Initializzation...\r\n");
		ret = aci_gatt_init();
		if(ret){
			testStatus = COMPONENT_ERROR;
			PRINTF("\r\nGATT_Init failed ****\r\n");
			goto fail;
		}

		//    ret = aci_gatt_update_char_value(service_handle, dev_name_char_handle, 0,
		//                                     7/*strlen(BoardName)*/, (uint8_t *)BoardName);
		//
		//    if(ret){
		//       PRINTF("\r\naci_gatt_update_char_value failed\r\n");
		//      while(1);
		//    }

		/* Set the GAP INIT like X-NUCLEO-IDB05A1 eval board  since using same SPBTLE_RF module*/
		ret = aci_gap_init_IDB05A1(GAP_PERIPHERAL_ROLE_IDB05A1, 0, 0x07, &service_handle, &dev_name_char_handle, &appearance_char_handle);

		if(ret != BLE_STATUS_SUCCESS){
			PRINTF("\r\nGAP_Init failed\r\n");
			goto fail;
		}

		// Added Jan 10th
		ret = hci_le_set_random_address(bdaddr);
		// Added Jan 10th
		const char BoardName[7] = {NAME_BLUEMS};
		// Added Jan 10th
		ret = aci_gatt_update_char_value(service_handle, dev_name_char_handle, 0,
				7/*strlen(BoardName)*/, (uint8_t *)BoardName);

		PRINTF("GAP setting Authentication ....\r\n");
		ret = aci_gap_set_auth_requirement(MITM_PROTECTION_REQUIRED,
				OOB_AUTH_DATA_ABSENT,
				NULL, 7, 16,
				USE_FIXED_PIN_FOR_PAIRING, 123456,
				BONDING);
		if (ret != BLE_STATUS_SUCCESS) {
			testStatus = COMPONENT_ERROR;
			PRINTF("\r\nGAP setting Authentication failed ******\r\n");
			goto fail;
		}

		PRINTF("SERVER: BLE Stack Initialized \r\n"
				"Board HWver=%d, FWver=%d.%d.%c\r\n"
				"BoardMAC = %x:%x:%x:%x:%x:%x\r\n",
				hwVersion,
				fwVersion>>8,
				(fwVersion>>4)&0xF,
				(hwVersion > 0x30) ? ('a'+(fwVersion&0xF)-1) : 'a',
						bdaddr[5],bdaddr[4],bdaddr[3],bdaddr[2],bdaddr[1],bdaddr[0]);

		/* Set output power level */
		aci_hal_set_tx_power_level(1,4);    /* -2.1dBm */

		ret = Add_ConsoleW2ST_Service();
		if(ret == BLE_STATUS_SUCCESS)
			PRINTF("Console Service W2ST added successfully\r\n");
		else{
			testStatus = COMPONENT_ERROR;
			PRINTF("\r\nError while adding Console Service W2ST\r\n");
		}

		ret = Add_ConfigW2ST_Service();
		if(ret == BLE_STATUS_SUCCESS)
			PRINTF("Config  Service W2ST added successfully\r\n");
		else{
			testStatus = COMPONENT_ERROR;
			PRINTF("\r\nError while adding Config Service W2ST\r\n");
		}

		PRINTF("\r\nAll test passed!\r\n");
	}
	else {
		testStatus = COMPONENT_ERROR;
		PRINTF("\r\nError in BlueNRG tests. ******\r\n");
	}
	PRINTF("****** END BLE TESTS ******\r\n");
	return;

	fail:
	testStatus = COMPONENT_ERROR;
	return;
}

/** @brief Initialize all the Custom BlueNRG services
 * @param None
 * @retval None
 */
static void Init_BlueNRG_Custom_Services(void)
{
	int ret;

	ret = Add_HWServW2ST_Service();
	if(ret == BLE_STATUS_SUCCESS) {
		PRINTF("HW      Service W2ST added successfully\r\n");
	} else {
		PRINTF("\r\nError while adding HW Service W2ST\r\n");
	}

	ret = Add_ConsoleW2ST_Service();
	if(ret == BLE_STATUS_SUCCESS) {
		PRINTF("Console Service W2ST added successfully\r\n");
	} else {
		PRINTF("\r\nError while adding Console Service W2ST\r\n");
	}

	ret = Add_ConfigW2ST_Service();
	if(ret == BLE_STATUS_SUCCESS) {
		PRINTF("Config  Service W2ST added successfully\r\n");
	} else {
		PRINTF("\r\nError while adding Config Service W2ST\r\n");
	}
}

/**
 * @brief  Send Motion Data Acc/Mag/Gyro to BLE
 * @param  None
 * @retval None
 */
static void SendMotionData(void)
{
	SensorAxes_t ACC_Value;
	SensorAxes_t GYR_Value;
	SensorAxes_t MAG_Value;



	ACC_Value.AXIS_X = acc.AXIS_X;
	ACC_Value.AXIS_Y = acc.AXIS_Y;
	ACC_Value.AXIS_Z = acc.AXIS_Z;
	GYR_Value.AXIS_X = gyro.AXIS_X;
	GYR_Value.AXIS_Y = gyro.AXIS_Y;
	GYR_Value.AXIS_Z = gyro.AXIS_Z;
	MAG_Value.AXIS_X = mag.AXIS_X;
	MAG_Value.AXIS_Y = mag.AXIS_Y;
	MAG_Value.AXIS_Z = mag.AXIS_Z;



	/*Debug */
	//PRINTF("ACC[X, Y, Z]: %d\t%d\t%d\t\n", ACC_Value.AXIS_X, ACC_Value.AXIS_Y, ACC_Value.AXIS_Z);
	//PRINTF("GYRO[X, Y, Z]: %d\t%d\t%d\t\n", GYR_Value.AXIS_X, GYR_Value.AXIS_Y, GYR_Value.AXIS_Z);
	//PRINTF("MAG[X, Y, Z]: %d\t%d\t%d\t\n", MAG_Value.AXIS_X, MAG_Value.AXIS_Y, MAG_Value.AXIS_Z);

	AccGyroMag_Update(&ACC_Value,&GYR_Value,&MAG_Value);

