rafaelwanner/ES_with_Drones/LAB5/STM32 FW Project/Official release - 170120/Src/main.c
}

static void SendBattEnvData(void)
{
	int32_t decPart, intPart;
	int32_t PressToSend=0;
	uint16_t BattToSend=0;
	int16_t RSSIToSend=0, TempToSend=0;
	int8_t rssi;
	uint16_t conn_handle;

	HAL_ADC_Start(&hadc1);
	if (HAL_ADC_PollForConversion(&hadc1, 1000000) == HAL_OK)
	{
		VBAT_Sense = HAL_ADC_GetValue(&hadc1);
		VBAT = (((VBAT_Sense*3.3)/4095)*(BAT_RUP+BAT_RDW))/BAT_RDW;
		//PRINTF("Battery voltage = %fV\n\n", VBAT);
	}
	HAL_ADC_Stop(&hadc1);

	MCR_BLUEMS_F2I_2D(press, intPart, decPart);
	PressToSend=intPart*100+decPart;
	// inserted by TP
	// VBAT percentage between 3.7 and 4.2V
	VBAT = ((VBAT - 3.7f)*100.0f)/(4.2f-3.7f);
	if (VBAT < 0) VBAT = 0;
	MCR_BLUEMS_F2I_1D(((int32_t)(VBAT)), intPart, decPart);
	BattToSend = intPart*10+decPart;
	if (BattToSend > 1000){
		BattToSend =1000;
	}
	MCR_BLUEMS_F2I_1D(temperature, intPart, decPart);
	TempToSend = intPart*10+decPart;

	hci_read_rssi(&conn_handle, &rssi);
	RSSIToSend = (int16_t)rssi*10;

	Batt_Env_RSSI_Update(PressToSend,BattToSend,(int16_t) TempToSend,RSSIToSend );

}


static void SendArmingData(void)
{
	ARMING_Update(rc_enable_motor);
}


static void InitSensFilter(void){

	/* Initialize settings for 6-axis MEMS Accelerometer */
	/* ODR 6.6kHz */
	/* FS 4g */
	/* Analog Filter Bandwith @ 1500Hz */
	/* ODR/2 low pass filtered sent to composite filter */
	/* Low pass filter enabled @ ODR/400 */
	BSP_ACCELERO_Set_ODR_Value(LSM6DSL_X_0_handle, 6660.0);       /* ODR 6.6kHz */
	BSP_ACCELERO_Set_FS(LSM6DSL_X_0_handle, FS_MID);                   /* FS 4g */
	LSM6DSL_ACC_GYRO_W_InComposit(LSM6DSL_X_0_handle, LSM6DSL_ACC_GYRO_IN_ODR_DIV_2);   /* ODR/2 low pass filtered sent to composite filter */
	LSM6DSL_ACC_GYRO_W_LowPassFiltSel_XL(LSM6DSL_X_0_handle, LSM6DSL_ACC_GYRO_LPF2_XL_ENABLE); /* Enable LPF2 filter in composite filter block */
	LSM6DSL_ACC_GYRO_W_HPCF_XL(LSM6DSL_X_0_handle, LSM6DSL_ACC_GYRO_HPCF_XL_DIV400); /* Low pass filter @ ODR/400 */
	uint8_t tmp_6axis_reg_value;
	BSP_ACCELERO_Read_Reg(LSM6DSL_X_0_handle, 0x10, &tmp_6axis_reg_value);
	tmp_6axis_reg_value = tmp_6axis_reg_value & 0xFE;                             /* Set LSB to 0 >> Analog filter 1500Hz*/
	BSP_ACCELERO_Write_Reg(LSM6DSL_X_0_handle, 0x10, tmp_6axis_reg_value);

	/* Initialize settings for 6-axis MEMS Gyroscope */
	/* FS 2000dps */
	/* ODR 416Hz */
	/* LPF1 FTYPE set to 10b */
	LSM6DSL_ACC_GYRO_W_LP_BW_G(LSM6DSL_G_0_handle, LSM6DSL_ACC_GYRO_LP_G_NARROW); /* LPF1 FTYPE set to 10b */
	BSP_GYRO_Write_Reg(LSM6DSL_G_0_handle, 0x11, 0x6C);                           /* Gyroscope settings: full scale 2000dps, ODR 416Hz */

	/* Initialize settings for Magnetometer settings (By default after reset is in in idle mode) */
	/* Register CFG_REG_A 0x60 = 0x8c */
	/* Register 0x61 = 0x02 */
	BSP_MAGNETO_Write_Reg(LIS2MDL_M_0_handle, 0x60, 0x8c);
	BSP_MAGNETO_Write_Reg(LIS2MDL_M_0_handle, 0x61, 0x02);

}



/* USER CODE END 4 */

#ifdef USE_FULL_ASSERT

/**
 * @brief Reports the name of the source file and the source line number
 * where the assert_param error has occurred.
 * @param file: pointer to the source file name
 * @param line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t* file, uint32_t line)
{
	/* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
	/* USER CODE END 6 */

}

#endif

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
